АлогистикТест2/src/Documents/алк_ПередачаНаОтветхранение/алк_ПередачаНаОтветхранение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ПередачаНаОтветхранение</name>
  <basedOn>Document.алк_ПриемкаЛесопродукции</basedOn>
  <basedOn>Document.алк_ПеремещениеЛесопродукции</basedOn>
  <registerRecords>AccumulationRegister.алк_УчетЛесопродукцииНаОтветхранении</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиБиржа</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ПеремещениеЛесопродукции</types>
      <types>DocumentRef.алк_ПриемкаЛесопродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатПроизводителя</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВагона</name>
    <comment>Номер вагона/автомобиля</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <comment>Номер ЖД накладной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПропускатьМинус</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штабель</name>
      <type>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Enums/алк_ВидыОперацийПеремещениеЗапасов/алк_ВидыОперацийПеремещениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыОперацийПеремещениеЗапасов</name>
  <enumValues>
    <name>ПередачаИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ВозвратНаПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеРасформированныхПакетов</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаУпаковку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСобственные</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаРеализацию</name>
  </enumValues>
  <enumValues>
    <name>РеализацияЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>РасформированиеПакета</name>
  </enumValues>
  <enumValues>
    <name>ПередачаСПереупаковки</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаОтветхранение</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаС_ЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаПереупаковку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСушку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаССушки</name>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаВСушильнуюКамеру</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаИзСушильнойКамеры</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВНезавершенноеПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПередачаСНезавершенногоПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаНаСГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаССушкиСырых</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УПП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УРП_СГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УРП_Магазин</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ПередачаНаОтветхранение/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПередачаНаОтветхранение, СтруктураДополнительныеСвойства) Экспорт
		
		СформироватьТаблицаУчетОтветхранения(ДокументСсылкаПередачаНаОтветхранение, СтруктураДополнительныеСвойства);
		
		СформироватьТаблицаЗапасыОрганизации(ДокументСсылкаПередачаНаОтветхранение, СтруктураДополнительныеСвойства);
		
		СформироватьТаблицаДокументыПослБиржа(ДокументСсылкаПередачаНаОтветхранение, СтруктураДополнительныеСвойства);
		
	КонецПроцедуры // ИнициализироватьДанныеДокумента()
	
	#КонецОбласти
	
	
	#Область Проведение
	
	// Формирует таблицу значений, содержащую данные для проведения по регистру.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура СформироватьТаблицаУчетОтветхранения(ДокументСсылкаПередачаНаОтветхранение, СтруктураДополнительныеСвойства)
		
			Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПередачаНаОтветхранениеЗапасы.Ссылка.ДатаСмены,
		|	алк_ПередачаНаОтветхранениеЗапасы.Ссылка.Смена,
		|	алк_ПередачаНаОтветхранениеЗапасы.Ссылка.СтруктурнаяЕдиница,
		|	алк_ПередачаНаОтветхранениеЗапасы.Штабель,
		|	алк_ПередачаНаОтветхранениеЗапасы.Номенклатура,
		|	алк_ПередачаНаОтветхранениеЗапасы.Характеристика,
		|	алк_ПередачаНаОтветхранениеЗапасы.Количество,
		|	алк_ПередачаНаОтветхранениеЗапасы.Объем,
		|	&ВидДвиженияНакопления КАК ВидДвижения,
		|	&Период,
		|	алк_ПередачаНаОтветхранениеЗапасы.Ссылка.ДокументОснование.Партия КАК ПартияТД,
		|	алк_ПередачаНаОтветхранениеЗапасы.Ссылка.ДокументОснование КАК Партия,
		|	алк_ПередачаНаОтветхранениеЗапасы.Ссылка.Организация,
		|	алк_ПередачаНаОтветхранениеЗапасы.Ссылка.Сертификат,
		|	алк_ПередачаНаОтветхранениеЗапасы.Ссылка.Производитель КАК Контрагент
		|ИЗ
		|	Документ.алк_ПередачаНаОтветхранение.Запасы КАК алк_ПередачаНаОтветхранениеЗапасы
		|ГДЕ
		|	алк_ПередачаНаОтветхранениеЗапасы.Ссылка.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("ВидДвиженияНакопления", ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаПередачаНаОтветхранение.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПередачаНаОтветхранение);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУчетОтветхранения", МассивРезультатов[0].Выгрузить());		
		
	КонецПроцедуры // СформироватьТаблицаЗапасыОрганизации
	
	// Формирует таблицу значений, содержащую данные для проведения по регистру.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура СформироватьТаблицаЗапасыОрганизации(ДокументСсылкаПередачаНаОтветхранение, СтруктураДополнительныеСвойства)
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПередачаНаОтветхранениеЗапасы.Ссылка.Организация,
		|	алк_ПередачаНаОтветхранениеЗапасы.Номенклатура,
		|	алк_ПередачаНаОтветхранениеЗапасы.Характеристика,
		|	алк_ПередачаНаОтветхранениеЗапасы.Количество,
		|	алк_ПередачаНаОтветхранениеЗапасы.Объем,
		|	&ВидДвиженияНакопленияРасход КАК ВидДвижения,
		|	&Период,
		|	алк_ПередачаНаОтветхранениеЗапасы.Ссылка.ДатаСмены,
		|	алк_ПередачаНаОтветхранениеЗапасы.Ссылка.Смена,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаНаОтветхранение) КАК Операция,
		|	алк_ПередачаНаОтветхранениеЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	алк_ПередачаНаОтветхранениеЗапасы.Штабель КАК Ячейка,
		|	алк_ПередачаНаОтветхранениеЗапасы.Ссылка.Сертификат
		|ИЗ
		|	Документ.алк_ПередачаНаОтветхранение.Запасы КАК алк_ПередачаНаОтветхранениеЗапасы
		|ГДЕ
		|	алк_ПередачаНаОтветхранениеЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПередачаНаОтветхранениеЗапасы.Ссылка.Организация,
		|	алк_ПередачаНаОтветхранениеЗапасы.Номенклатура,
		|	алк_ПередачаНаОтветхранениеЗапасы.Характеристика,
		|	алк_ПередачаНаОтветхранениеЗапасы.Количество,
		|	алк_ПередачаНаОтветхранениеЗапасы.Объем,
		|	&ВидДвиженияНакопленияРасход КАК ВидДвижения,
		|	&Период,
		|	алк_ПередачаНаОтветхранениеЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	алк_ПередачаНаОтветхранениеЗапасы.Штабель КАК Штабель,
		|	алк_ПередачаНаОтветхранениеЗапасы.Ссылка.Сертификат,
		|	ЛОЖЬ КАК Ответхранение
		|ИЗ
		|	Документ.алк_ПередачаНаОтветхранение.Запасы КАК алк_ПередачаНаОтветхранениеЗапасы
		|ГДЕ
		|	алк_ПередачаНаОтветхранениеЗапасы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ПередачаНаОтветхранениеЗапасы.Ссылка.Организация,
		|	алк_ПередачаНаОтветхранениеЗапасы.Номенклатура,
		|	алк_ПередачаНаОтветхранениеЗапасы.Характеристика,
		|	алк_ПередачаНаОтветхранениеЗапасы.Количество,
		|	алк_ПередачаНаОтветхранениеЗапасы.Объем,
		|	&ВидДвиженияНакопленияПриход,
		|	&Период,
		|	алк_ПередачаНаОтветхранениеЗапасы.Ссылка.СтруктурнаяЕдиница,
		|	алк_ПередачаНаОтветхранениеЗапасы.Штабель,
		|	алк_ПередачаНаОтветхранениеЗапасы.Ссылка.Сертификат,
		|	ИСТИНА
		|ИЗ
		|	Документ.алк_ПередачаНаОтветхранение.Запасы КАК алк_ПередачаНаОтветхранениеЗапасы
		|ГДЕ
		|	алк_ПередачаНаОтветхранениеЗапасы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияРасход", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияПриход", ВидДвиженияНакопления.Приход);
		
		Запрос.УстановитьПараметр("Период", ДокументСсылкаПередачаНаОтветхранение.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПередачаНаОтветхранение);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыОрганизации", МассивРезультатов[0].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЛесопродукции", МассивРезультатов[1].Выгрузить());

		
	КонецПроцедуры // СформироватьТаблицаЗапасыОрганизации
	
	// Формирует таблицу значений, содержащую данные для проведения по регистру.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура СформироватьТаблицаДокументыПослБиржа(ДокументСсылкаПередачаНаОтветхранение, СтруктураДополнительныеСвойства)
		
		Запрос = Новый Запрос;
		
		Пользователь = Пользователи.ТекущийПользователь();
		
		ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнойОтветственный");
		ОсновнойОтветственный = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.Сотрудники.ПустаяСсылка());
		
		Запрос.УстановитьПараметр("Сотрудник", ОсновнойОтветственный);
		
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПередачаНаОтветхранение.Ссылка.Организация КАК Организация,
		|	&Период,
		|	алк_ПередачаНаОтветхранение.Ссылка.ДатаСмены КАК ДатаСмены,
		|	алк_ПередачаНаОтветхранение.Ссылка.Смена КАК Смена,
		|	0 КАК МоментПроведения,
		|	&Сотрудник
		|ИЗ
		|	Документ.алк_ПередачаНаОтветхранение КАК алк_ПередачаНаОтветхранение
		|ГДЕ
		|	алк_ПередачаНаОтветхранение.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Период", ДокументСсылкаПередачаНаОтветхранение.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПередачаНаОтветхранение);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		тРезультат = МассивРезультатов[0].Выгрузить();
		
		Для каждого стр Из тРезультат Цикл
			
			стр.МоментПроведения = ТекущаяУниверсальнаяДатаВМиллисекундах();
			
		КонецЦикла; 
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДокументыПослБиржа", тРезультат);
		
		
	КонецПроцедуры // СформироватьТаблицаДокументыПослБиржа
	
	#КонецОбласти 
	
	
	#Область ИнтерфейсПечати
	
	// Сформировать печатные формы объектов
	//
	// ВХОДЯЩИЕ:
	//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
	//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
	//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
	//
	// ИСХОДЯЩИЕ:
	//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
	//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
	//
	Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
		//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТТН") Тогда
		// 
		// УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТТН", "1-Т (Товарно-транспортная накладная)", Обработки.алк_ПечатьТТН.ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
		// 
		//КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МХ_1_1") Тогда			
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МХ_1_1", "Акт передачи на ответхранение.", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "МХ_1_1"));			
			
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МХ_1_2") Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МХ_1_2", "Акт передачи на ответхранение.", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "МХ_1_2"));
			
		КонецЕсли;

		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МХ_1_3") Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МХ_1_3", "Акт передачи на ответхранение.", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "МХ_1_3"));
			
		КонецЕсли;

		
	КонецПроцедуры
	
	// Заполняет список команд печати.
	// 
	// Параметры:
	//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
	//
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "МХ_1_1";
		КомандаПечати.Представление = НСтр("ru = 'Акт передачи на ответхранение (Поставщик-Партнер)'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 1;
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "МХ_1_2";
		КомандаПечати.Представление = НСтр("ru = 'Акт передачи на ответхранение (Партнер-ТД)'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 2;

		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "МХ_1_3";
		КомандаПечати.Представление = НСтр("ru = 'Акт передачи на ответхранение (ТД-АЛК)'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 3;

				
	КонецПроцедуры
	
	// Сформировать печатные формы объектов
	//
	Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
		
		Перем Ошибки;
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		ПервыйДокумент = Истина;
		
		Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			Если ИмяМакета = "МХ_1_1" Или ИмяМакета = "МХ_1_2" Или ИмяМакета = "МХ_1_3" Тогда
				
				Сформировать_МХ_1(ТабличныйДокумент, ТекущийДокумент, ИмяМакета);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		
		Возврат ТабличныйДокумент;
		
	КонецФункции // ПечатнаяФорма()
	
	// Процедура формирования Акта "МХ-1"
	//
	Процедура Сформировать_МХ_1(ТабличныйДокумент, ТекущийДокумент, ИмяМакета)
		
		МакетАкта = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ПередачаНаОтветхранение.МХ_1");
		
		ОбластьШапка = МакетАкта.ПолучитьОбласть("Шапка");
		
		// Организация
		// Производитель
		
		Поклажедатель = Справочники.Контрагенты.ПустаяСсылка();
		Хранитель = Справочники.Контрагенты.ПустаяСсылка();
		
		Если ИмяМакета = "МХ_1_1" Тогда  // Поставщик (Поклажедатель) - Поставщик.Партнер (Хранитель)
			
			Поклажедатель = ТекущийДокумент.Производитель;
			Хранитель =  Поклажедатель.Партнер;
			
			Суффикс = "-1";
						
		ИначеЕсли ИмяМакета = "МХ_1_2" Тогда  // Поставщик.Партнер (Поклажедатель) - Поставщик.Партнер.Партнер (Хранитель)
			
			Поклажедатель = ТекущийДокумент.Производитель.Партнер;
			
			Если ЗначениеЗаполнено(Поклажедатель) Тогда
				Хранитель =  Поклажедатель.Партнер;
			Иначе
				Сообщить("Не заполнен партнер!");
			КонецЕсли;
			
			Суффикс = "-2";
						
		ИначеЕсли ИмяМакета = "МХ_1_3" Тогда  // Поставщик.Партнер.Партнер (Поклажедатель) - АЛК (Хранитель)
			
			Партнер = ТекущийДокумент.Производитель.Партнер;
			
			Если ЗначениеЗаполнено(Партнер) Тогда
				Поклажедатель =  Партнер.Партнер;
			Иначе
				Сообщить("Не заполнен партнер!");
			КонецЕсли; 
			
			Хранитель  = ТекущийДокумент.Организация;
			
			Суффикс = "-3";
			
		КонецЕсли;	
		
		ОбластьШапка.Параметры.Номер = "" + ТекущийДокумент.Номер + Суффикс;
		ОбластьШапка.Параметры.Дата  = Формат(ТекущийДокумент.Дата, "ДЛФ=Д");
				
	
		//Хранитель
		СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Хранитель, ТекущийДокумент.Дата, ,);
		ОбластьШапка.Параметры.Организация = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ФактическийАдрес");
		
		//Поклажедатель
		СведенияОбПроставщике = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Поклажедатель, ТекущийДокумент.Дата, ,);
		ОбластьШапка.Параметры.Производитель = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбПроставщике, "ПолноеНаименование,ФактическийАдрес");
			   
		СведенияОбПроизводителе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(ТекущийДокумент.Производитель, ТекущийДокумент.Дата, ,);
		Производитель = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбПроизводителе, "ПолноеНаименование,ФактическийАдрес");
		 	
		ОбластьШапка.Параметры.Хранение = "ТС: " + ТекущийДокумент.НомерВагона + " , накладная: " + ТекущийДокумент.НомерНакладной + ", " + Производитель;
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ОбластьСтрока = МакетАкта.ПолучитьОбласть("Строка");
		
		Для каждого стрЗапасы Из ТекущийДокумент.Запасы Цикл
			
			ОбластьСтрока.Параметры.Заполнить(стрЗапасы);			
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
		ОбластьПодвал = МакетАкта.ПолучитьОбласть("Подвал");
		
		ОбластьПодвал.Параметры.Объем = ТекущийДокумент.Запасы.Итог("Объем");
		
		Если ЗначениеЗаполнено(ТекущийДокумент.Сертификат) Тогда
			ОбластьПодвал.Параметры.Сертификат = ТекущийДокумент.Сертификат.ПредставлениеНаПечать;		
		КонецЕсли; 
			
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
				
	КонецПроцедуры //СформироватьАктПриемки()	
	
	Процедура УстановитьОтбор(Настройки, ИмяПараметра, Значение)
		
		ОбрПараметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
		
		Если ОбрПараметр <> Неопределено Тогда
			
			ОбрПараметр.Использование = Истина;
			ОбрПараметр.Значение      = Значение;
			
		КонецЕсли; 
		
	КонецПроцедуры
	
	#КонецОбласти
	
	
#КонецЕсли

Процедура Конец()
КонецПроцедуры
